## Terraform Plan Results

#### Format Check: `success`
#### TFLint: `success`
#### Initialization: `success`
#### Validation: `success`
#### Plan: `success`

<details><summary>Show Plan Output</summary>

```terraform
cloudflare_workers_kv_namespace.cv_data: Refreshing state... [id=c9df8a4271984ad8bb0a02c30ff3568d]
cloudflare_r2_bucket.cv_assets: Refreshing state... [id=cv-assets]
cloudflare_workers_domain.api_prod: Refreshing state... [id=105e7157f83705932eee35719523d984abfbfb10]
cloudflare_workers_kv_namespace.rate_limit: Refreshing state... [id=30a87d8776c04d54a423fdd4e84cba5f]
cloudflare_workers_kv_namespace.cv_data_dev: Refreshing state... [id=80606d373eff4764b8756c28026fdae9]
cloudflare_zero_trust_access_identity_provider.github: Refreshing state... [id=25849e22-6651-4117-b808-5bfe41e3f111]
cloudflare_zero_trust_access_application.api: Refreshing state... [id=abbb0943-079f-4f4f-b3bd-9affa669cdc8]
cloudflare_workers_kv_namespace.cv_history_dev: Refreshing state... [id=169821c5c47344688128023a671f74a5]
cloudflare_workers_domain.frontend_prod: Refreshing state... [id=ef7e093e72af97c1f29ff0be83161c96b24b11a9]
cloudflare_workers_domain.api_dev[0]: Refreshing state... [id=d1385e91ee48168b185821fc6e0bbe73c3b77ccb]
cloudflare_zone_settings_override.security: Refreshing state... [id=06db6df758e9485e19dab46e271a2d71]
cloudflare_zero_trust_access_application.admin: Refreshing state... [id=ebf8c467-e85e-4e3b-a7de-dd71af63e1eb]
cloudflare_workers_kv_namespace.rate_limit_dev: Refreshing state... [id=07d3925af5594accb6bae93f7e9ba4ec]
cloudflare_workers_kv_namespace.cv_history: Refreshing state... [id=0c0ada9ed85a427fb87b97bd5761e407]
cloudflare_workers_domain.frontend_dev[0]: Refreshing state... [id=cce9d4898d379f840a3efe54e349cae15d3485c8]
cloudflare_zero_trust_access_policy.api_allow_users: Refreshing state... [id=e1fce468-9861-4346-b7c3-688385a57d02]
cloudflare_zero_trust_access_policy.admin_allow: Refreshing state... [id=fdc0e7ae-f6ba-4328-9bd2-f0f58f0c7401]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_turnstile_widget.contact_form will be created
  + resource "cloudflare_turnstile_widget" "contact_form" {
      + account_id     = (sensitive value)
      + bot_fight_mode = (known after apply)
      + domains        = [
          + "arnoldcartagena.com",
          + "cv.arnoldcartagena.com",
        ]
      + id             = (known after apply)
      + mode           = "managed"
      + name           = "CV Contact Form"
      + offlabel       = false
      + region         = (known after apply)
      + secret         = (sensitive value)
    }

  # cloudflare_turnstile_widget.contact_form_dev[0] will be created
  + resource "cloudflare_turnstile_widget" "contact_form_dev" {
      + account_id     = (sensitive value)
      + bot_fight_mode = (known after apply)
      + domains        = [
          + "dev-cv.arnoldcartagena.com",
          + "localhost",
        ]
      + id             = (known after apply)
      + mode           = "managed"
      + name           = "CV Contact Form (Dev)"
      + offlabel       = false
      + region         = (known after apply)
      + secret         = (sensitive value)
    }

  # cloudflare_worker_secret.resend_api_key_dev[0] will be created
  + resource "cloudflare_worker_secret" "resend_api_key_dev" {
      + account_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "RESEND_API_KEY"
      + script_name = "cv-arnold-api-dev"
      + secret_text = (sensitive value)
    }

  # cloudflare_worker_secret.resend_api_key_prod will be created
  + resource "cloudflare_worker_secret" "resend_api_key_prod" {
      + account_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "RESEND_API_KEY"
      + script_name = "cv-arnold-api"
      + secret_text = (sensitive value)
    }

  # cloudflare_worker_secret.turnstile_secret_dev[0] will be created
  + resource "cloudflare_worker_secret" "turnstile_secret_dev" {
      + account_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "TURNSTILE_SECRET_KEY"
      + script_name = "cv-arnold-api-dev"
      + secret_text = (sensitive value)
    }

  # cloudflare_worker_secret.turnstile_secret_prod will be created
  + resource "cloudflare_worker_secret" "turnstile_secret_prod" {
      + account_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "TURNSTILE_SECRET_KEY"
      + script_name = "cv-arnold-api"
      + secret_text = (sensitive value)
    }

  # cloudflare_workers_kv_namespace.contact_submissions will be created
  + resource "cloudflare_workers_kv_namespace" "contact_submissions" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + title      = "CONTACT_SUBMISSIONS"
    }

  # cloudflare_workers_kv_namespace.contact_submissions_dev will be created
  + resource "cloudflare_workers_kv_namespace" "contact_submissions_dev" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + title      = "CONTACT_SUBMISSIONS_DEV"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + contact_submissions_kv_ids = {
      + dev        = (known after apply)
      + production = (known after apply)
    }
  + turnstile_secret_keys      = (sensitive value)
  + turnstile_site_keys        = {
      + dev        = (known after apply)
      + production = (known after apply)
    }

Warning: Deprecated Resource

  with cloudflare_worker_secret.resend_api_key_prod,
  on main.tf line 292, in resource "cloudflare_worker_secret" "resend_api_key_prod":
 292: resource "cloudflare_worker_secret" "resend_api_key_prod" {

`cloudflare_worker_secret` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_secret` instead.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @acartag7, Action: `pull_request`*